espressif/esp-idf/examples/peripherals/i2s/i2s_test/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# Disable PSRAM
CONFIG_SPIRAM=n

# Disable other potentially problematic components
CONFIG_ESP_PSRAM_MODE_DISABLE=y
